Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АутентификацияИАвторизация/Ext/Module.bsl
Процедура Разлогиниться() Экспорт
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
		ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();    
	КонецЕсли;
КонецПроцедуры    

Процедура ВыполнитьАутентификацию(Логин) Экспорт    
	Соединение    = Новый HTTPСоединение("192.168.0.144",,"MobileClient");//(1)
	Запрос        = Новый HTTPЗапрос("barber/hs/users/getUser?username="+Логин);//(2)
	Ответ        = Соединение.Получить(Запрос);//(3)    
	Если Ответ.КодСостояния = 200 Тогда
		МассивДанныхПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		Если МассивДанныхПользователя.Количество() = 0 Тогда //(4)
			Сообщить("По логину " + Логин +" пользователь не найден!");
		ИначеЕсли ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда //(5)
			АвторизоватьПользователя(МассивданныхПользователя[0],);
		КонецЕсли;
	Иначе
		Сообщить("При попытке аутентификации произошла ошибка!");
	КонецЕсли;    
КонецПроцедуры

Процедура АвторизоватьПользователя(ДанныеПользователя, Телефон) Экспорт
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = ДанныеПользователя;
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
    НовыйПользовательИБ.Записать();
    
    ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя);
    Если ТекущийПользователь.Пустая() Тогда
        НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
        НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
        НовыйПользователь.ВнешнийGUID = НовыйПользователь.Код;  
        НовыйПользователь.Наименование = ДанныеПользователя;
		НовыйПользователь.Телефон = Телефон; 
        НовыйПользователь.Записать(); 
    КонецЕсли;
    
    ПараметрыСеанса.ТекущийПользователь = НовыйПользователь.Ссылка;
	
КонецПроцедуры
